Revit 2027 API
ImageExportOptions.ImageResolution Property
 The image resolution in dots per inch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ImageResolution ImageResolution { get; set; }
Public Property ImageResolution As ImageResolution
	Get
	Set
public:
property ImageResolution ImageResolution {
	ImageResolution get ();
	void set (ImageResolution value);
}
member ImageResolution : ImageResolution with get, set
Property Value
ImageResolution
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default is DPI_72.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace